In [1]:
%load_ext sql
%sql mysql://root:root@localhost/testing_system_db

In [2]:
%%sql
SHOW TABLES;

 * mysql://root:***@localhost/testing_system_db
11 rows affected.

[('account',),
 ('answer',),
 ('categoryquestion',),
 ('department',),
 ('exam',),
 ('examquestion',),
 ('group',),
 ('groupaccount',),
 ('position',),
 ('question',),
 ('typequestion',)]

# Exercise 1. JOIN

## Question 1. Truy vấn danh sách Nhân viên và Phòng ban của họ

In [42]:
%%sql
SELECT  AccountID, FullName, DepartmentID
FROM    account
LIMIT   1;

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(1, 'Michael Johnson', 3)]

In [43]:
%%sql
SELECT  *
FROM    department;

 * mysql://root:***@localhost/testing_system_db
5 rows affected.

[(1, 'Engineering'),
 (4, 'Finance'),
 (3, 'Human Resources'),
 (2, 'Marketing'),
 (5, 'Operations')]

In [44]:
%%sql
SELECT  a.AccountID, a.FullName, d.*
FROM    account     AS  a
JOIN    department  AS  d
ON      d.DepartmentID = a.DepartmentID;

 * mysql://root:***@localhost/testing_system_db
19 rows affected.

[(2, 'John Doe', 1, 'Engineering'),
 (6, 'Sarah Wilson', 1, 'Engineering'),
 (7, 'Christopher Lee', 1, 'Engineering'),
 (15, 'Alice Smith', 1, 'Engineering'),
 (16, 'Bob Jones', 1, 'Engineering'),
 (5, 'Emily Davis', 4, 'Finance'),
 (13, 'Ashley Martinez', 4, 'Finance'),
 (14, 'James Lopez', 4, 'Finance'),
 (1, 'Michael Johnson', 3, 'Human Resources'),
 (10, 'Jessica Garcia', 3, 'Human Resources'),
 (12, 'Daniel Rodriguez', 3, 'Human Resources'),
 (4, 'Jane Smith', 2, 'Marketing'),
 (11, 'Amanda Thompson', 2, 'Marketing'),
 (3, 'David Brown', 5, 'Operations'),
 (8, 'Emma Taylor', 5, 'Operations'),
 (9, 'Nathan Hernandez', 5, 'Operations'),
 (17, 'Carol Wilson', 5, 'Operations'),
 (18, 'Dave Clark', 5, 'Operations'),
 (19, 'Ryan Martinez', 5, 'Operations')]

## Question 2. Truy vấn thông tin các Account được tạo sau ngày 01/05/2024

In [45]:
%%sql
SELECT  *
FROM    account
WHERE   CreateDate > '2024-05-01';

 * mysql://root:***@localhost/testing_system_db
5 rows affected.

[(15, 'alice.smith456@hotmail.com', 'alice_smith', 'Alice Smith', 1, 6, datetime.datetime(2024, 5, 15, 0, 0)),
 (16, 'bob.jones789@protonmail.com', 'bob_jones', 'Bob Jones', 1, 6, datetime.datetime(2024, 5, 16, 0, 0)),
 (17, 'carol.wilson123@live.com', 'carol_wilson', 'Carol Wilson', 5, 11, datetime.datetime(2024, 5, 31, 0, 0)),
 (18, 'dave_clark456@yandex.com', 'dave_clark', 'Dave Clark', 5, 11, datetime.datetime(2024, 5, 31, 0, 0)),
 (19, 'ryan.martinez@icloud.com', 'ryan_martinez', 'Ryan Martinez', 5, 11, datetime.datetime(2024, 5, 31, 0, 0))]

## Question 3. Truy vấn tất cả các Engineer

In [46]:
%%sql
SELECT  *
FROM    position
WHERE   PositionName = 'Engineer';

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(6, 'Engineer')]

In [47]:
%%sql
SELECT  *
FROM    account
WHERE   PositionID = 6;

 * mysql://root:***@localhost/testing_system_db
4 rows affected.

[(6, 'sarah89@gmail.com', 'sarah_wilson', 'Sarah Wilson', 1, 6, datetime.datetime(2024, 3, 1, 0, 0)),
 (7, 'christopher_lee123@yahoo.com', 'christopher_lee', 'Christopher Lee', 1, 6, datetime.datetime(2024, 3, 1, 0, 0)),
 (15, 'alice.smith456@hotmail.com', 'alice_smith', 'Alice Smith', 1, 6, datetime.datetime(2024, 5, 15, 0, 0)),
 (16, 'bob.jones789@protonmail.com', 'bob_jones', 'Bob Jones', 1, 6, datetime.datetime(2024, 5, 16, 0, 0))]

In [48]:
%%sql
SELECT  *
FROM    account
WHERE   PositionID =    (SELECT PositionID 
                        FROM    position
                        WHERE   PositionName = 'Engineer');

 * mysql://root:***@localhost/testing_system_db
4 rows affected.

[(6, 'sarah89@gmail.com', 'sarah_wilson', 'Sarah Wilson', 1, 6, datetime.datetime(2024, 3, 1, 0, 0)),
 (7, 'christopher_lee123@yahoo.com', 'christopher_lee', 'Christopher Lee', 1, 6, datetime.datetime(2024, 3, 1, 0, 0)),
 (15, 'alice.smith456@hotmail.com', 'alice_smith', 'Alice Smith', 1, 6, datetime.datetime(2024, 5, 15, 0, 0)),
 (16, 'bob.jones789@protonmail.com', 'bob_jones', 'Bob Jones', 1, 6, datetime.datetime(2024, 5, 16, 0, 0))]

In [49]:
%%sql
SELECT  a.*, p.PositionName
FROM    account     AS a
JOIN    position    AS p
ON      p.PositionID = a.PositionID
WHERE   p.PositionName = 'Engineer';

 * mysql://root:***@localhost/testing_system_db
4 rows affected.

[(6, 'sarah89@gmail.com', 'sarah_wilson', 'Sarah Wilson', 1, 6, datetime.datetime(2024, 3, 1, 0, 0), 'Engineer'),
 (7, 'christopher_lee123@yahoo.com', 'christopher_lee', 'Christopher Lee', 1, 6, datetime.datetime(2024, 3, 1, 0, 0), 'Engineer'),
 (15, 'alice.smith456@hotmail.com', 'alice_smith', 'Alice Smith', 1, 6, datetime.datetime(2024, 5, 15, 0, 0), 'Engineer'),
 (16, 'bob.jones789@protonmail.com', 'bob_jones', 'Bob Jones', 1, 6, datetime.datetime(2024, 5, 16, 0, 0), 'Engineer')]

## Question 4. Truy vấn danh sách các Phòng ban có >4 Nhân viên

In [50]:
%%sql
SELECT  *
FROM    department;

 * mysql://root:***@localhost/testing_system_db
5 rows affected.

[(1, 'Engineering'),
 (4, 'Finance'),
 (3, 'Human Resources'),
 (2, 'Marketing'),
 (5, 'Operations')]

In [51]:
%%sql
SELECT      DepartmentID, COUNT(AccountID)
FROM        account
GROUP BY    DepartmentID
HAVING      COUNT(AccountID) > 4;

 * mysql://root:***@localhost/testing_system_db
2 rows affected.

[(1, 5), (5, 6)]

In [56]:
%%sql
SELECT      a.DepartmentID, d.DepartmentName, COUNT(a.AccountID) AS NUM_EMPL
FROM        account     AS a
JOIN        department  AS d
ON          d.DepartmentID = a.DepartmentID
GROUP BY    DepartmentID
HAVING      NUM_EMPL > 4;

 * mysql://root:***@localhost/testing_system_db
2 rows affected.

[(1, 'Engineering', 5), (5, 'Operations', 6)]

## Question 5. Truy vấn danh sách Câu hỏi được sử dụng nhiều nhất trong đề thi

In [32]:
%%sql
SELECT      QuestionID, COUNT(ExamID) AS NUM_EXAM
FROM        examquestion
GROUP BY    QuestionID
ORDER BY    NUM_EXAM DESC
LIMIT       6;

 * mysql://root:***@localhost/testing_system_db
6 rows affected.

[(1, 3), (4, 3), (6, 3), (7, 3), (15, 3), (2, 2)]

In [21]:
%%sql
SELECT      QuestionID, COUNT(ExamID) AS NUM_EXAM
FROM        examquestion
GROUP BY    QuestionID
HAVING      NUM_EXAM = 3;

 * mysql://root:***@localhost/testing_system_db
5 rows affected.

[(1, 3), (4, 3), (6, 3), (7, 3), (15, 3)]

In [64]:
%%sql
SELECT  MAX(NUM_EXAM)
FROM    (SELECT     QuestionID, COUNT(ExamID) AS NUM_EXAM
        FROM        examquestion
        GROUP BY    QuestionID)
        AS examquestion_count;

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(3,)]

In [49]:
%%sql
SELECT      e.ExamID, e.QuestionID, q.Content
FROM        examquestion    AS e
JOIN        question        AS q    ON  q.QuestionID = e.QuestionID
WHERE       e.QuestionID=1;

 * mysql://root:***@localhost/testing_system_db
3 rows affected.

[(1, 1, 'Quy định về nơi được phép hút thuốc trong công ty'),
 (2, 1, 'Quy định về nơi được phép hút thuốc trong công ty'),
 (5, 1, 'Quy định về nơi được phép hút thuốc trong công ty')]

In [50]:
%%sql
SELECT      e.QuestionID, q.Content, COUNT(e.ExamID)
FROM        examquestion    AS e
JOIN        question        AS q    ON  q.QuestionID = e.QuestionID
GROUP BY    e.QuestionID
HAVING      e.QuestionID=1;

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(1, 'Quy định về nơi được phép hút thuốc trong công ty', 3)]

In [66]:
%%sql
SELECT      e.QuestionID, q.Content, COUNT(e.ExamID) AS NUM_EXAM
FROM        examquestion    AS e
JOIN        question        AS q    ON  q.QuestionID = e.QuestionID
GROUP BY    e.QuestionID
HAVING      NUM_EXAM = (SELECT  MAX(NUM_EXAM)
                        FROM    (SELECT     QuestionID, COUNT(ExamID) AS NUM_EXAM
                                FROM        examquestion
                                GROUP BY    QuestionID) AS examquestion_count);

 * mysql://root:***@localhost/testing_system_db
5 rows affected.

[(1, 'Quy định về nơi được phép hút thuốc trong công ty', 3),
 (4, 'Mỗi nhân viên được cấp bao nhiêu ngày phép năm hằng tháng', 3),
 (6, 'Kể tên những mối nguy về điện trong môi trường làm việc', 3),
 (7, 'Có bao nhiêu bước trong tiêu lệnh chữa cháy', 3),
 (15, 'Mục tiêu chất lượng của công ty là gì?', 3)]

## Question 6. Thống kê mỗi Category được sử dụng trong bao nhiêu Question

In [68]:
%%sql
SELECT      CategoryID, COUNT(QuestionID)
FROM        question
GROUP BY    CategoryID;

 * mysql://root:***@localhost/testing_system_db
4 rows affected.

[(1, 5), (2, 5), (3, 5), (4, 3)]

In [82]:
%%sql
SELECT      q.CategoryID, c.CategoryName, COUNT(q.QuestionID)
FROM        question            AS q
LEFT JOIN   categoryquestion    AS c
ON          c.CategoryID = q.CategoryID
GROUP BY    q.CategoryID;

 * mysql://root:***@localhost/testing_system_db
4 rows affected.

[(1, 'Quy định chung', 5),
 (2, 'An toàn', 5),
 (3, 'Hiểu biết chung', 5),
 (4, 'Phương pháp', 3)]

## Question 7. Thống kê mỗi Question được sử dụng trong bao nhiêu Exam

In [100]:
%%sql
SELECT      *
FROM        examquestion    AS e
LEFT JOIN   question        AS  q
ON          q.QuestionID = e.QuestionID
ORDER BY    e.ExamID
LIMIT        5;

 * mysql://root:***@localhost/testing_system_db
5 rows affected.

[(1, 1, 1, 'Quy định về nơi được phép hút thuốc trong công ty', 1, 1, 1, datetime.datetime(2024, 3, 1, 0, 0)),
 (1, 2, 2, 'Quy định về thời gian hút thuốc trong giờ giải lao', 1, 2, 1, datetime.datetime(2024, 3, 1, 0, 0)),
 (1, 7, 7, 'Có bao nhiêu bước trong tiêu lệnh chữa cháy', 2, 2, 2, datetime.datetime(2024, 3, 5, 0, 0)),
 (1, 8, 8, 'Các nguyên tắc trong sơ cấp cứu ban đầu', 2, 1, 2, datetime.datetime(2024, 3, 5, 0, 0)),
 (2, 1, 1, 'Quy định về nơi được phép hút thuốc trong công ty', 1, 1, 1, datetime.datetime(2024, 3, 1, 0, 0))]

In [101]:
%%sql
SELECT      q.QuestionID, q.Content, COUNT(e.ExamID) AS NUM_EXAM
FROM        examquestion    AS e
LEFT JOIN   question        AS  q   ON  q.QuestionID = e.QuestionID
GROUP BY    q.QuestionID;

 * mysql://root:***@localhost/testing_system_db
18 rows affected.

[(1, 'Quy định về nơi được phép hút thuốc trong công ty', 3),
 (2, 'Quy định về thời gian hút thuốc trong giờ giải lao', 2),
 (3, 'Quy định về việc xin nghỉ phép, nghỉ ốm', 2),
 (4, 'Mỗi nhân viên được cấp bao nhiêu ngày phép năm hằng tháng', 3),
 (5, 'Quy định về việc đăng ký tăng ca và số giờ tăng ca', 2),
 (6, 'Kể tên những mối nguy về điện trong môi trường làm việc', 3),
 (7, 'Có bao nhiêu bước trong tiêu lệnh chữa cháy', 3),
 (8, 'Các nguyên tắc trong sơ cấp cứu ban đầu', 2),
 (9, 'Có bao nhiêu bước trong phương pháp 5S nơi làm việc', 1),
 (10, 'Kể tên những mối nguy về hóa chất có thể gặp', 2),
 (11, 'Quy định về việc trang bị đẩy đủ bảo hộ lao động', 1),
 (12, 'Bạn biết gì về nguyên lý 80/20', 1),
 (13, '5W1H và 5M1E là viết tắt của những từ gì?', 2),
 (14, 'Ứng dụng sơ đồ xương cá trong phân tích nguyên nnhân gốc rễ', 1),
 (15, 'Mục tiêu chất lượng của công ty là gì?', 3),
 (16, 'Mục tiêu không tai nạn lao động trong 1 năm', 2),
 (17, 'Công ty đang sản xuất những mặt hàng nào', 2),
 (18, 'Các lỗi sản phẩm hay gặp trong sản xuất', 2)]

## Question 8. Truy vấn Question có nhiều câu trả lời nhất

In [122]:
%%sql
SELECT      a.QuestionID, q.Content, COUNT(AnswerID) AS ANSW_COUNT_COL
FROM        answer      AS a
LEFT JOIN   question    AS q
ON          q.QuestionID = a.QuestionID
GROUP BY    a.QuestionID;

 * mysql://root:***@localhost/testing_system_db
16 rows affected.

[(1, 'Quy định về nơi được phép hút thuốc trong công ty', 6),
 (2, 'Quy định về thời gian hút thuốc trong giờ giải lao', 2),
 (3, 'Quy định về việc xin nghỉ phép, nghỉ ốm', 4),
 (4, 'Mỗi nhân viên được cấp bao nhiêu ngày phép năm hằng tháng', 1),
 (5, 'Quy định về việc đăng ký tăng ca và số giờ tăng ca', 4),
 (6, 'Kể tên những mối nguy về điện trong môi trường làm việc', 2),
 (7, 'Có bao nhiêu bước trong tiêu lệnh chữa cháy', 2),
 (8, 'Các nguyên tắc trong sơ cấp cứu ban đầu', 5),
 (9, 'Có bao nhiêu bước trong phương pháp 5S nơi làm việc', 3),
 (10, 'Kể tên những mối nguy về hóa chất có thể gặp', 2),
 (11, 'Quy định về việc trang bị đẩy đủ bảo hộ lao động', 2),
 (13, '5W1H và 5M1E là viết tắt của những từ gì?', 2),
 (15, 'Mục tiêu chất lượng của công ty là gì?', 2),
 (16, 'Mục tiêu không tai nạn lao động trong 1 năm', 1),
 (17, 'Công ty đang sản xuất những mặt hàng nào', 1),
 (18, 'Các lỗi sản phẩm hay gặp trong sản xuất', 2)]

In [106]:
%%sql
SELECT      QuestionID, COUNT(AnswerID) AS NUM_ANSW
FROM        answer
GROUP BY    QuestionID
ORDER BY    NUM_ANSW DESC
LIMIT       5;

 * mysql://root:***@localhost/testing_system_db
5 rows affected.

[(1, 6), (8, 5), (3, 4), (5, 4), (9, 3)]

In [113]:
%%sql
SELECT  MAX(NUM_ANSW)
FROM    (SELECT     COUNT(AnswerID) AS NUM_ANSW
        FROM        answer
        GROUP BY    QuestionID) AS answer_count_table;

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(6,)]

In [115]:
%%sql
SELECT      a.QuestionID, q.Content, COUNT(AnswerID) AS ANSW_COUNT_COL
FROM        answer      AS a
LEFT JOIN   question    AS q
ON          q.QuestionID = a.QuestionID
GROUP BY    a.QuestionID
HAVING      ANSW_COUNT_COL = (SELECT  MAX(NUM_ANSW)
                            FROM    (SELECT     COUNT(AnswerID) AS NUM_ANSW
                                    FROM        answer
                                    GROUP BY    QuestionID) AS answer_count_table);

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(1, 'Quy định về nơi được phép hút thuốc trong công ty', 6)]

## Question 9. Thống kê số lượng Account trong mỗi Group

In [139]:
%%sql
SELECT  *
FROM    `Group`;

 * mysql://root:***@localhost/testing_system_db
9 rows affected.

[(1, 'Management Team', 1, datetime.datetime(2024, 2, 23, 0, 0)),
 (2, 'HR Support', 1, datetime.datetime(2024, 3, 1, 0, 0)),
 (3, 'ENG Team', 2, datetime.datetime(2024, 3, 2, 0, 0)),
 (4, 'Operations Team', 3, datetime.datetime(2024, 3, 3, 0, 0)),
 (5, 'Marketing Team', 4, datetime.datetime(2024, 3, 11, 0, 0)),
 (6, 'HR Team', 1, datetime.datetime(2024, 3, 11, 0, 0)),
 (7, 'Finance Team', 5, datetime.datetime(2024, 3, 23, 0, 0)),
 (8, 'ENG_Help Team', 2, datetime.datetime(2024, 3, 27, 0, 0)),
 (9, 'Analyst Team', 4, datetime.datetime(2024, 3, 30, 0, 0))]

In [152]:
%%sql
SELECT      ga.GroupID, g.GroupName, COUNT(ga.AccountID) 
FROM        GroupAccount AS ga
RIGHT JOIN  `Group`      AS g
ON          g.GroupId = ga.GroupID
GROUP BY    g.GroupID;

 * mysql://root:***@localhost/testing_system_db
9 rows affected.

[(1, 'Management Team', 5),
 (2, 'HR Support', 15),
 (3, 'ENG Team', 5),
 (4, 'Operations Team', 7),
 (5, 'Marketing Team', 2),
 (6, 'HR Team', 3),
 (7, 'Finance Team', 2),
 (8, 'ENG_Help Team', 6),
 (None, 'Analyst Team', 0)]

## Question 10. Tìm chức vụ có ít người nhất

In [162]:
%%sql
SELECT      *
FROM        Position
ORDER BY    PositionID;

 * mysql://root:***@localhost/testing_system_db
11 rows affected.

[(1, 'Engineering Manager'),
 (2, 'Marketing Manager'),
 (3, 'HR Manager'),
 (4, 'Finance Manager'),
 (5, 'Operations Manager'),
 (6, 'Engineer'),
 (7, 'Operations Specialist'),
 (8, 'HR Specialist'),
 (9, 'Marketer'),
 (10, 'Financial Analyst'),
 (11, 'Operator')]

In [167]:
%%sql
SELECT      a.PositionID, COUNT(a.AccountID) AS NUM_ACCOUNT_COL
FROM        Account AS a
GROUP BY    a.PositionID;

 * mysql://root:***@localhost/testing_system_db
11 rows affected.

[(1, 1),
 (2, 1),
 (3, 1),
 (4, 1),
 (5, 1),
 (6, 4),
 (7, 2),
 (8, 2),
 (9, 1),
 (10, 1),
 (11, 4)]

In [194]:
%%sql
SELECT  MIN(COUNT_ACC_COL)
FROM    (SELECT     a.PositionID, COUNT(a.AccountID) AS COUNT_ACC_COL
        FROM        Account AS a
        GROUP BY    a.PositionID) AS count_acc_table;

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(1,)]

In [190]:
%%sql
SELECT      a.PositionID, p.PositionName, COUNT(a.AccountID) AS COUNT_ACC_COL
FROM        `Account`    AS a
RIGHT JOIN  `Position`   AS p    ON  p.PositionID = a.PositionID
GROUP BY    p.PositionID
ORDER BY    COUNT_ACC_COL;

 * mysql://root:***@localhost/testing_system_db
11 rows affected.

[(1, 'Engineering Manager', 1),
 (2, 'Marketing Manager', 1),
 (3, 'HR Manager', 1),
 (4, 'Finance Manager', 1),
 (5, 'Operations Manager', 1),
 (9, 'Marketer', 1),
 (10, 'Financial Analyst', 1),
 (7, 'Operations Specialist', 2),
 (8, 'HR Specialist', 2),
 (6, 'Engineer', 4),
 (11, 'Operator', 4)]

In [195]:
%%sql
SELECT      a.PositionID, p.PositionName, COUNT(a.AccountID) AS COUNT_ACC_COL
FROM        `Account`    AS a
RIGHT JOIN  `Position`   AS p    ON  p.PositionID = a.PositionID
GROUP BY    p.PositionID
HAVING      COUNT_ACC_COL = (SELECT     MIN(COUNT_ACC_COL)
                            FROM        (SELECT     a.PositionID, COUNT(a.AccountID) AS COUNT_ACC_COL
                                        FROM        Account AS a
                                        GROUP BY    a.PositionID) AS count_acc_table);

 * mysql://root:***@localhost/testing_system_db
7 rows affected.

[(1, 'Engineering Manager', 1),
 (2, 'Marketing Manager', 1),
 (3, 'HR Manager', 1),
 (4, 'Finance Manager', 1),
 (5, 'Operations Manager', 1),
 (9, 'Marketer', 1),
 (10, 'Financial Analyst', 1)]

## Question 11. Thống kê mỗi phòng ban có những chức vụ nào và số lượng mỗi chức vụ là bao nhiêu

In [217]:
%%sql
SELECT d.DepartmentName, p.PositionName, COUNT(a.AccountID) AS NumAccounts
FROM Account AS a
RIGHT JOIN Position AS p ON p.PositionID = a.PositionID
RIGHT JOIN Department AS d ON d.DepartmentID = a.DepartmentID
GROUP BY d.DepartmentName, p.PositionName
ORDER BY d.DepartmentID, p.PositionID;

 * mysql://root:***@localhost/testing_system_db
11 rows affected.

[('Engineering', 'Engineering Manager', 1),
 ('Engineering', 'Engineer', 4),
 ('Marketing', 'Marketing Manager', 1),
 ('Marketing', 'Marketer', 1),
 ('Human Resources', 'HR Manager', 1),
 ('Human Resources', 'HR Specialist', 2),
 ('Finance', 'Finance Manager', 1),
 ('Finance', 'Financial Analyst', 1),
 ('Operations', 'Operations Manager', 1),
 ('Operations', 'Operations Specialist', 2),
 ('Operations', 'Operator', 4)]

## Question 12. Lấy thông tin chi tiết của câu hỏi

In [256]:
%%sql
SELECT      q.QuestionID, q.Content, cq.CategoryName AS Category, tq.TypeName AS Type, ac.FullName AS Creator, COUNT(DISTINCT eq.ExamID) AS NUM_EXAM, COUNT(DISTINCT an.AnswerID) AS NUM_ANSWER
FROM        question            AS q
LEFT JOIN   categoryquestion    AS cq   ON  cq.CategoryID   = q.CategoryID
LEFT JOIN   typequestion        AS tq   ON  tq.TypeID       = q.TypeID
LEFT JOIN   account             AS ac   ON  ac.AccountID    = q.CreatorID
LEFT JOIN   examquestion        AS eq   ON  eq.QuestionID   = q.QuestionID
LEFT JOIN   answer              AS an   ON  an.QuestionID   = q.QuestionID
GROUP BY    q.QuestionID;

 * mysql://root:***@localhost/testing_system_db
18 rows affected.

[(1, 'Quy định về nơi được phép hút thuốc trong công ty', 'Quy định chung', 'Essay', 'Michael Johnson', 3, 6),
 (2, 'Quy định về thời gian hút thuốc trong giờ giải lao', 'Quy định chung', 'Multiple-Choice', 'Michael Johnson', 2, 2),
 (3, 'Quy định về việc xin nghỉ phép, nghỉ ốm', 'Quy định chung', 'Essay', 'Michael Johnson', 2, 4),
 (4, 'Mỗi nhân viên được cấp bao nhiêu ngày phép năm hằng tháng', 'Quy định chung', 'Multiple-Choice', 'Michael Johnson', 3, 1),
 (5, 'Quy định về việc đăng ký tăng ca và số giờ tăng ca', 'Quy định chung', 'Essay', 'Michael Johnson', 2, 4),
 (6, 'Kể tên những mối nguy về điện trong môi trường làm việc', 'An toàn', 'Essay', 'John Doe', 3, 2),
 (7, 'Có bao nhiêu bước trong tiêu lệnh chữa cháy', 'An toàn', 'Multiple-Choice', 'John Doe', 3, 2),
 (8, 'Các nguyên tắc trong sơ cấp cứu ban đầu', 'An toàn', 'Essay', 'John Doe', 2, 5),
 (9, 'Có bao nhiêu bước trong phương pháp 5S nơi làm việc', 'Hiểu biết chung', 'Multiple-Choice', 'David Brown', 1, 3),
 (10, 'Kể tên những mối nguy về hóa chất có thể gặp', 'An toàn', 'Essay', 'David Brown', 2, 2),
 (11, 'Quy định về việc trang bị đẩy đủ bảo hộ lao động', 'An toàn', 'Essay', 'David Brown', 1, 2),
 (12, 'Bạn biết gì về nguyên lý 80/20', 'Phương pháp', 'Essay', 'Emily Davis', 1, 0),
 (13, '5W1H và 5M1E là viết tắt của những từ gì?', 'Phương pháp', 'Multiple-Choice', 'Emily Davis', 2, 2),
 (14, 'Ứng dụng sơ đồ xương cá trong phân tích nguyên nnhân gốc rễ', 'Phương pháp', 'Essay', 'Emily Davis', 1, 0),
 (15, 'Mục tiêu chất lượng của công ty là gì?', 'Hiểu biết chung', 'Essay', 'Jane Smith', 3, 2),
 (16, 'Mục tiêu không tai nạn lao động trong 1 năm', 'Hiểu biết chung', 'Multiple-Choice', 'Michael Johnson', 2, 1),
 (17, 'Công ty đang sản xuất những mặt hàng nào', 'Hiểu biết chung', 'Essay', 'David Brown', 2, 1),
 (18, 'Các lỗi sản phẩm hay gặp trong sản xuất', 'Hiểu biết chung', 'Multiple-Choice', 'David Brown', 2, 2)]

## Question 13. Truy vấn số lượng câu hỏi của mỗi loại tự luận hay trắc nghiệm

In [261]:
%%sql
SELECT      tq.TypeName, COUNT(q.QuestionID) AS NUM_Q
FROM        question        AS  q
LEFT JOIN   typequestion    AS tq   ON tq.TypeID = q.TypeID
GROUP BY    tq.TypeName;

 * mysql://root:***@localhost/testing_system_db
2 rows affected.

[('Essay', 11), ('Multiple-Choice', 7)]

## Question 14. Truy vấn Group không có Account nào

In [153]:
%%sql
SELECT      ga.GroupID, g.GroupName, COUNT(ga.AccountID) AS NUM_ACCOUNT_COL
FROM        GroupAccount AS ga
RIGHT JOIN  `Group`      AS g
ON          g.GroupId = ga.GroupID
GROUP BY    g.GroupID
HAVING      NUM_ACCOUNT_COL = 0;

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(None, 'Analyst Team', 0)]

## Question 15. Truy vấn Question không có Answer nào

In [121]:
%%sql
SELECT      q.QuestionID, q.Content, COUNT(a.AnswerID) AS ANSW_COUNT_COL
FROM        question    AS q
LEFT JOIN   answer      AS a
ON          a.QuestionID = q.QuestionID
GROUP BY    q.QuestionID
HAVING      ANSW_COUNT_COL = 0;

 * mysql://root:***@localhost/testing_system_db
2 rows affected.

[(12, 'Bạn biết gì về nguyên lý 80/20', 0),
 (14, 'Ứng dụng sơ đồ xương cá trong phân tích nguyên nnhân gốc rễ', 0)]

# Exercise 2. Union

## Question 17

### Question 17a. Lấy các Account thuộc nhóm thứ 1

In [4]:
%%sql
SELECT  *
FROM    GroupAccount
WHERE   GroupID = 1;

 * mysql://root:***@localhost/testing_system_db
5 rows affected.

[(1, 1, datetime.datetime(2024, 2, 23, 0, 0)),
 (1, 2, datetime.datetime(2024, 2, 24, 0, 0)),
 (1, 3, datetime.datetime(2024, 2, 24, 0, 0)),
 (1, 4, datetime.datetime(2024, 2, 24, 0, 0)),
 (1, 5, datetime.datetime(2024, 2, 24, 0, 0))]

### Question 17b. Lấy các Account thuộc nhóm thứ 2

In [5]:
%%sql
SELECT  *
FROM    GroupAccount
WHERE   GroupID = 2;

 * mysql://root:***@localhost/testing_system_db
15 rows affected.

[(2, 1, datetime.datetime(2024, 3, 1, 0, 0)),
 (2, 6, datetime.datetime(2024, 3, 2, 0, 0)),
 (2, 7, datetime.datetime(2024, 3, 2, 0, 0)),
 (2, 8, datetime.datetime(2024, 3, 2, 0, 0)),
 (2, 9, datetime.datetime(2024, 3, 3, 0, 0)),
 (2, 10, datetime.datetime(2024, 3, 11, 0, 0)),
 (2, 11, datetime.datetime(2024, 3, 11, 0, 0)),
 (2, 12, datetime.datetime(2024, 3, 21, 0, 0)),
 (2, 13, datetime.datetime(2024, 3, 22, 0, 0)),
 (2, 14, datetime.datetime(2024, 3, 22, 0, 0)),
 (2, 15, datetime.datetime(2024, 5, 16, 0, 0)),
 (2, 16, datetime.datetime(2024, 5, 17, 0, 0)),
 (2, 17, datetime.datetime(2024, 6, 1, 0, 0)),
 (2, 18, datetime.datetime(2024, 6, 1, 0, 0)),
 (2, 19, datetime.datetime(2024, 6, 1, 0, 0))]

### Question 17c. Ghép 2 kết quả từ câu a) và câu b) sao cho không có Record nào trùng nhau

In [7]:
%%sql
(SELECT * FROM GroupAccount WHERE GroupID = 1)
UNION DISTINCT
(SELECT * FROM GroupAccount WHERE GroupID = 2);

 * mysql://root:***@localhost/testing_system_db
20 rows affected.

[(1, 1, datetime.datetime(2024, 2, 23, 0, 0)),
 (1, 2, datetime.datetime(2024, 2, 24, 0, 0)),
 (1, 3, datetime.datetime(2024, 2, 24, 0, 0)),
 (1, 4, datetime.datetime(2024, 2, 24, 0, 0)),
 (1, 5, datetime.datetime(2024, 2, 24, 0, 0)),
 (2, 1, datetime.datetime(2024, 3, 1, 0, 0)),
 (2, 6, datetime.datetime(2024, 3, 2, 0, 0)),
 (2, 7, datetime.datetime(2024, 3, 2, 0, 0)),
 (2, 8, datetime.datetime(2024, 3, 2, 0, 0)),
 (2, 9, datetime.datetime(2024, 3, 3, 0, 0)),
 (2, 10, datetime.datetime(2024, 3, 11, 0, 0)),
 (2, 11, datetime.datetime(2024, 3, 11, 0, 0)),
 (2, 12, datetime.datetime(2024, 3, 21, 0, 0)),
 (2, 13, datetime.datetime(2024, 3, 22, 0, 0)),
 (2, 14, datetime.datetime(2024, 3, 22, 0, 0)),
 (2, 15, datetime.datetime(2024, 5, 16, 0, 0)),
 (2, 16, datetime.datetime(2024, 5, 17, 0, 0)),
 (2, 17, datetime.datetime(2024, 6, 1, 0, 0)),
 (2, 18, datetime.datetime(2024, 6, 1, 0, 0)),
 (2, 19, datetime.datetime(2024, 6, 1, 0, 0))]

## Question 18

### Question 18a. Lấy các Group có >5 thành viên

In [11]:
%%sql
SELECT      GroupID, COUNT(AccountID) AS NUM_ACC
FROM        GroupAccount
GROUP BY    GroupID
HAVING      NUM_ACC > 5;

 * mysql://root:***@localhost/testing_system_db
3 rows affected.

[(2, 15), (4, 7), (8, 6)]

### Question 18b. Lấy các group có >7 thành viên

In [12]:
%%sql
SELECT      GroupID, COUNT(AccountID) AS NUM_ACC
FROM        GroupAccount
GROUP BY    GroupID
HAVING      NUM_ACC > 7;

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(2, 15)]

### Question 18c. Ghép 2 kết quả từ câu a) và câu b)

In [14]:
%%sql
(SELECT      GroupID, COUNT(AccountID) AS NUM_ACC
FROM        GroupAccount
GROUP BY    GroupID
HAVING      NUM_ACC > 5)
UNION ALL
(SELECT      GroupID, COUNT(AccountID) AS NUM_ACC
FROM        GroupAccount
GROUP BY    GroupID
HAVING      NUM_ACC > 7);

 * mysql://root:***@localhost/testing_system_db
4 rows affected.

[(2, 15), (4, 7), (8, 6), (2, 15)]